УТ/src/InformationRegisters/CRM_ОбъектыАРМ_Обращения/CRM_ОбъектыАРМ_Обращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОбъектыАРМ_Обращения</name>
  <resources>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СмещениеДатыЗаполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СмещениеДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Звонок_Состояние</name>
    <type>
      <types>EnumRef.сфпСостоянияЗвонков</types>
    </type>
  </resources>
  <resources>
    <name>Письмо_Папка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </resources>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.CRM_Обращения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияЛидов</types>
    </type>
  </resources>
  <resources>
    <name>СконвертированВОбъект</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанСКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтмеченВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/CRM_ВидыКаналовПоступленияОбращений/CRM_ВидыКаналовПоступленияОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыКаналовПоступленияОбращений</name>
  <enumValues>
    <name>ЭлектроннаяПочта</name>
  </enumValues>
  <enumValues>
    <name>ТелефонныйЗвонок</name>
  </enumValues>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>Диалоги</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Documents/CRM_СообщениеМессенджера/CRM_СообщениеМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_СообщениеМессенджера</name>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_Пользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_Сообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.CRM_ВидыСообщенияМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диалог</name>
    <type>
      <types>CatalogRef.CRM_Диалоги</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отложенное</name>
    <comment>Признак запланированной отправки сообщения.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

УТ/src/Catalogs/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новое</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонено</description>
    </items>
    <items>
      <name>Повторный</name>
      <description>Повторное</description>
    </items>
    <items>
      <name>ПовторныйОбработанный</name>
      <description>Повторное (обработанное)</description>
    </items>
    <items>
      <name>Потерян</name>
      <description>Потеряно</description>
    </items>
    <items>
      <name>Сконвертирован</name>
      <description>Сконвертировано</description>
    </items>
  </predefined>
</mdclass:Catalog>

УТ/src/InformationRegisters/CRM_ОбъектыАРМ_Обращения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПереходНаНовуюВерсию

Процедура ЗаполнитьДанныеПриПереходеНаВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 5000
	|	CRM_СостоянияЛидов.Лид КАК Лид,
	|	CRM_СостоянияЛидов.ВидКанала КАК ВидКанала,
	|	CRM_СостоянияЛидов.КаналПолучения КАК КаналПолучения,
	|	CRM_СостоянияЛидов.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.CRM_СостоянияЛидов КАК CRM_СостоянияЛидов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыАРМ_Обращения КАК CRM_ОбъектыАРМ_Обращения
	|		ПО CRM_СостоянияЛидов.Лид = CRM_ОбъектыАРМ_Обращения.Объект
	|ГДЕ
	|	CRM_СостоянияЛидов.Состояние В (ЗНАЧЕНИЕ(Справочник.CRM_СостоянияЛидов.Новый),
	|		CRM_СостоянияЛидов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияЛидов.Повторный))
	|	И НЕ CRM_СостоянияЛидов.Лид ССЫЛКА Документ.CRM_СообщениеМессенджера
	|	И CRM_ОбъектыАРМ_Обращения.Объект ЕСТЬ NULL
	|	И НЕ CRM_СостоянияЛидов.Лид.CRM_СкрытьВАРМ
	|	И НЕ CRM_СостоянияЛидов.Лид.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_СостоянияЛидов.Лид.ДатаНачала УБЫВ,
	|	CRM_СостоянияЛидов.Лид.Дата УБЫВ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗарегистрироватьЛидВАРМ(Выборка.Лид, Выборка.Состояние);
	КонецЦикла;
	
	Выборка.Сбросить();
	
	Если Выборка.Следующий() Тогда
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Лид); 
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = (Выборка.Количество() < 5000);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЛидЗарегистрированВАРМ(Объект) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество() > 0;
	
КонецФункции

Процедура ЗарегистрироватьЛидВАРМ(Источник, Знач Состояние) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		Объект = Источник.Диалог;
		СостояниеЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Источник.Диалог);
		Если СостояниеЛида <> Неопределено Тогда
			Состояние = СостояниеЛида.Состояние;
		КонецЕсли;
	Иначе
		Объект = Источник;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Записать();
	
	Если Объект.CRM_СкрытьВАРМ Или Объект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние = Справочники.CRM_СостоянияЛидов.Новый
		Или Состояние = Справочники.CRM_СостоянияЛидов.Повторный Тогда
		
		Заголовок = "";
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Объект;
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.CRM_Заявка") Тогда
			МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.Заявка;
			МенеджерЗаписи.КаналПолучения = Объект.ИсточникПолучения;
			Заголовок = Объект.Тема;
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
			МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.ТелефонныйЗвонок;
			МенеджерЗаписи.Избранный = (Объект.Важность = Перечисления.ВариантыВажностиВзаимодействия.Высокая);
			МенеджерЗаписи.Звонок_Состояние = Объект.сфпСостояниеЗвонка;
			Заголовок = Объект.Тема;
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
			МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.Диалоги;
			МенеджерЗаписи.КаналПолучения = Объект.УчетнаяЗапись;
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
			МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.ЭлектроннаяПочта;
			МенеджерЗаписи.КаналПолучения = Объект.УчетнаяЗапись;
			МенеджерЗаписи.Избранный = Объект.CRM_Избранный;
			МенеджерЗаписи.СмещениеДаты = Объект.CRM_СмещениеДатыОтправления;
			МенеджерЗаписи.СмещениеДатыЗаполнено = Объект.CRM_СмещениеДатыОтправленияЗаполнено;
			МенеджерЗаписи.Письмо_Папка = CRM_Взаимодействия.ПапкаПисьма(Объект);
			Заголовок = Объект.Тема;
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
			МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.ЭлектроннаяПочта;
			МенеджерЗаписи.КаналПолучения = Объект.УчетнаяЗапись;
			МенеджерЗаписи.Избранный = Объект.CRM_Избранный;
			Заголовок = Объект.Тема;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
			МенеджерЗаписи.Ответственный = Объект.Ответственный;
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "CRM_РольОтветственного")
			И ЗначениеЗаполнено(Объект.CRM_РольОтветственного) Тогда
			МенеджерЗаписи.Ответственный = Объект.CRM_РольОтветственного;
		КонецЕсли;

		Если ТипЗнч(Источник) = Тип("СправочникСсылка.CRM_Диалоги")
			Или ТипЗнч(Источник) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
			
			ПоследнееСообщение = CRM_РаботаСМессенджерамиСервер.ПоследнееСообщениеДиалога(Объект);
			
			Если ТипЗнч(Источник) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
				ТемпДата = Источник.ДатаНачала;
				ТемпЗаголовок = "";
			Иначе
				ТемпДата = Источник.Дата;
				ТемпЗаголовок = СокрЛП(Источник.ТекстСообщения);
			КонецЕсли;
			Если ПоследнееСообщение = Неопределено Тогда
				МенеджерЗаписи.Дата = ТемпДата;
				Заголовок = ТемпЗаголовок;
			Иначе
				Если ПоследнееСообщение.Дата > ТемпДата Тогда
					МенеджерЗаписи.Дата = ПоследнееСообщение.Дата;
					Заголовок = ПоследнееСообщение.ТекстСокр;
				Иначе
					МенеджерЗаписи.Дата = ТемпДата;
					Заголовок = ТемпЗаголовок;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			МенеджерЗаписи.Дата = Источник.Дата;
		КонецЕсли;
		
		МенеджерЗаписи.Заголовок = Заголовок;
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПапкуПисьма(Письмо) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Письмо);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Письмо_Папка = Неопределено;		
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
